alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_gpio_reg.h
#ifndef __ASSEMBLER__

typedef struct gpio_reg_reg_s
{
    volatile unsigned int gpio_out;
    volatile unsigned int gpio_out_w1ts;
    volatile unsigned int gpio_out_w1tc;
    volatile unsigned int gpio_enable;
    volatile unsigned int gpio_enable_w1ts;
    volatile unsigned int gpio_enable_w1tc;
    volatile unsigned int gpio_in;
    volatile unsigned int gpio_status;
    volatile unsigned int gpio_status_w1ts;
    volatile unsigned int gpio_status_w1tc;
    volatile unsigned int gpio_pin0;
    volatile unsigned int gpio_pin1;
    volatile unsigned int gpio_pin2;
    volatile unsigned int gpio_pin3;
    volatile unsigned int gpio_pin4;
    volatile unsigned int gpio_pin5;
    volatile unsigned int gpio_pin6;
    volatile unsigned int gpio_pin7;
    volatile unsigned int gpio_pin8;
    volatile unsigned int gpio_pin9;
    volatile unsigned int gpio_pin10;
    volatile unsigned int gpio_pin11;
    volatile unsigned int gpio_pin12;
    volatile unsigned int gpio_pin13;
    volatile unsigned int gpio_pin14;
    volatile unsigned int gpio_pin15;
    volatile unsigned int gpio_pin16;
    volatile unsigned int gpio_pin17;
    volatile unsigned int sdio_pin;
    volatile unsigned int clk_req_pin;
    volatile unsigned int sigma_delta;
    volatile unsigned int debug_control;
    volatile unsigned int debug_input_sel;
    volatile unsigned int debug_out;
    volatile unsigned int la_control;
    volatile unsigned int la_clock;
    volatile unsigned int la_status;
    volatile unsigned int la_trigger_sample;
    volatile unsigned int la_trigger_position;
    volatile unsigned int la_pre_trigger;
    volatile unsigned int la_post_trigger;
    volatile unsigned int la_filter_control;
    volatile unsigned int la_filter_data;
    volatile unsigned int la_filter_wildcard;
    volatile unsigned int la_triggera_data;
    volatile unsigned int la_triggera_wildcard;
    volatile unsigned int la_triggerb_data;
    volatile unsigned int la_triggerb_wildcard;
    volatile unsigned int la_trigger;
    volatile unsigned int la_fifo;
    volatile unsigned int la[2];
    volatile unsigned int ant_pin;
    volatile unsigned int antd_pin;
    volatile unsigned int gpio_pin;
    volatile unsigned int gpio_h_pin;
    volatile unsigned int bt_pin;
    volatile unsigned int bt_wlan_pin;
    volatile unsigned int si_uart_pin;
    volatile unsigned int clk32k_pin;
    volatile unsigned int reset_tuple_status;
} gpio_reg_reg_t;

#endif /* __ASSEMBLER__ */

#endif /* _GPIO_REG_H_ */
